grevaillot/svd_tools/headers/STM32F7x3/otg_fs_device.h
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_dieptsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dtxfsts2 OTGFSDTXFSTS2 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DTXFSTS2_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS2_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dtxfsts2_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepctl3 OTGFSDIEPCTL3 OTG device endpoint-3 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_fs_diepctl3_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl3_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_diepctl3_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepint3 OTGFSDIEPINT3 device endpoint-3 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPINT3_TXFE TXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT3_INEPNE INEPNE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT3_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT3_TOC TOC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT3_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT3_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_dieptsiz3 OTGFSDIEPTSIZ3 device endpoint-3 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dieptsiz3_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_dieptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_dieptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dtxfsts3 OTGFSDTXFSTS3 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DTXFSTS3_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS3_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dtxfsts3_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepctl4 OTGFSDIEPCTL4 OTG device endpoint-4 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_fs_diepctl4_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl4_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_diepctl4_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepint4 OTGFSDIEPINT4 device endpoint-4 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPINT4_TXFE TXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT4_INEPNE INEPNE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT4_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT4_TOC TOC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT4_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT4_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_dieptsiz4 OTGFSDIEPTSIZ4 device endpoint-4 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dieptsiz4_mcnt MCNT Multi count
@{*/
/**@}*/


